# Session 11

In [ ]:
import pandas as pd

In [ ]:
path = 'movies.csv'
df = pd.read_csv(path)
df.head()

                title rating  year  runtime
0       Almost Famous      R  2000    122.0
1        American Pie      R  1999     95.0
2  Back to the Future     PG  1985    116.0
3        Blade Runner      R  1982    117.0
4   Blood for Dracula      R  1974    106.0

In [ ]:
df['rating'].value_counts()

rating
R            12
PG            8
PG-13         6
GP            1
Not Rated     1
NC-17         1
G             1
Name: count, dtype: int64

Group   >>  Aggregation Function >> sum  ,mean ,min  ,max ,count

In [ ]:
df.groupby('rating')['runtime'].mean()

rating
G             86.000000
GP           127.000000
NC-17         85.000000
Not Rated    125.000000
PG           101.000000
PG-13        122.600000
R            105.454545
Name: runtime, dtype: float64

get me total sales per category

In [ ]:
df.groupby('year')['title'].count()

year
1960    1
1965    1
1967    1
1970    1
1974    1
1978    1
1981    1
1982    1
1983    1
1984    1
1985    3
1986    4
1987    2
1988    2
1995    1
1996    1
1999    1
2000    1
2001    1
2004    2
2007    1
2011    1
Name: title, dtype: int64

### 6- Join/Combine

In [ ]:
row_A1 = {'Nid':1,'Add':'Alex','Age':25}
row_A2 = {'Nid':2,'Add':'Cairo','Age':30}
row_A3 = {'Nid':4,'Add':'behira','Age':55}
row_A4 = {'Nid':10,'Add':'menof','Age':64}
row_A5 = {'Nid':15,'Add':'alamin','Age':20}
row_A6 = {'Nid':20,'Add':'Aswan','Age':15}

Data_A = pd.DataFrame([row_A1,row_A2,row_A3,
                        row_A4,row_A5,row_A6])

Data_A

   Nid     Add  Age
0    1    Alex   25
1    2   Cairo   30
2    4  behira   55
3   10   menof   64
4   15  alamin   20
5   20   Aswan   15

In [ ]:
row_B1 = {'Nid':20,'Sal':5000,'Mother':'Sara'}
row_B2 = {'Nid':10,'Sal':4500,'Mother':'Eman'}
row_B3 = {'Nid':16,'Sal':3000,'Mother':'Aml'}
row_B4 = {'Nid':5,'Sal':10000,'Mother':"Rania"}
row_B5 = {'Nid':3,'Sal':9700,'Mother':'Laila'}
row_B6 = {'Nid':2,'Sal':20000,'Mother':'Sahar'}
row_B7 = {'Nid':4,'Sal':6500,'Mother':'Hend'}

Data_B = pd.DataFrame([row_B1,row_B2,row_B3,
                        row_B4,row_B5,row_B6,
                        row_B7])

Data_B

   Nid    Sal Mother
0   20   5000   Sara
1   10   4500   Eman
2   16   3000    Aml
3    5  10000  Rania
4    3   9700  Laila
5    2  20000  Sahar
6    4   6500   Hend

In [ ]:
Data_A

   Nid     Add  Age
0    1    Alex   25
1    2   Cairo   30
2    4  behira   55
3   10   menof   64
4   15  alamin   20
5   20   Aswan   15

In [ ]:
Data_merged = Data_A.merge(Data_B,
              how='inner',
              on='Nid'
              )
Data_merged

   Nid     Add  Age    Sal Mother
0    2   Cairo   30  20000  Sahar
1    4  behira   55   6500   Hend
2   10   menof   64   4500   Eman
3   20   Aswan   15   5000   Sara

In [ ]:
row_A1 = {'Nid':1,'Add':'Alex','Age':25}
row_A2 = {'Nid':2,'Add':'Cairo','Age':30}
row_A3 = {'Nid':4,'Add':'behira','Age':55}


Data_A1 = pd.DataFrame([row_A1,row_A2,row_A3,
                        ])

Data_A1

   Nid     Add  Age
0    1    Alex   25
1    2   Cairo   30
2    4  behira   55

In [ ]:
row_A4 = {'Nid':10,'Add':'menof','Age':64}
row_A5 = {'Nid':15,'Add':'alamin','Age':20}
row_A6 = {'Nid':20,'Add':'Aswan','Age':15}


Data_A2 = pd.DataFrame([row_A4,row_A5,row_A6,
                        ])

Data_A2

   Nid     Add  Age
0   10   menof   64
1   15  alamin   20
2   20   Aswan   15

In [ ]:
pd.concat([Data_A1, Data_A2],
            axis=0,
            ignore_index=True
            )

   Nid     Add  Age
0    1    Alex   25
1    2   Cairo   30
2    4  behira   55
3   10   menof   64
4   15  alamin   20
5   20   Aswan   15

### 7- Exporting Data

In [ ]:
df_merge = Data_A.merge(Data_B,
                        how='inner',
                        on='Nid')

In [ ]:
df_merge

   Nid     Add  Age    Sal Mother
0    2   CAiro   30  20000  Sahar
1    4  behira   55   6500   Hend
2   10   menof   64   4500   Eman
3   20   Aswan   15   5000   Sara

In [ ]:
df_merge.to_csv('merge.csv', index=False  )	#Write to a CSV file

Task

In [ ]:
df.to_excel('merge.xlsx') #	Write to an Excel file